frontend/views/announcement/_search.php

SELECT * FROM `tpkm_category`
---
    ?>


 <?= $form->field($model, 'id_category')->dropDownList(ArrayHelper::map(Category::find()->asArray()->all(), 'id', 'category_name'), ['prompt'=>'-Choose a Category-']) ?>