frontend/views/proposal/_search.php

SELECT * FROM `tpkm_category`
---
            ->textInput(['placeholder' => "Topic"])
    ?>

    <?=
    $form->field($model, 'id_category', $fieldOptions1)->dropDownList(ArrayHelper::map(Category::find()
                            ->asArray()
                            ->all(), 'id', 'category_name'), ['prompt' => '-All Category-'])