frontend/controllers/AnnouncementController.php

SELECT * FROM `tpkm_announcement` WHERE `id`='7'
---
    protected function findModel($id) {
        if (($model = Announcement::findOne($id)) !== null) {