frontend/controllers/ForumController.php

    public function actionForums()
    {
        $dataProvider = Forum::find()->all();
---
SELECT * FROM `forum`