frontend/controllers/GroupController.php

    public function actionView($id) {



        $proposal = Proposal::findOne(['id_group' => $id]);
---
SELECT * FROM `tpkm_proposal` WHERE `id_group`='7'

        $id_user;

        if(!Yii::$app->user->isGuest){
        if (\common\models\students\Students::find()->where(['user_id' => Yii::$app->user->id])->one() != null) {
---
SELECT * FROM `tpkm_students` WHERE `user_id`=9

            }
        }
        else{
            $id_user = \common\models\pegawai\Pegawai::find()->where(['user_id' =>Yii::$app->user->id])->one()->pegawai_id;
---
SELECT * FROM `tpkm_pegawai` WHERE `user_id`=9

        }
        }

        $supervisior_assgnment = SupervisiorAssignment::findOne(['id_group' => $id]);
        $leader_assgnment = LeaderAssignment::findOne(['id_group' => $id]);
---
SELECT * FROM `tpkm_supervisior_assignment` WHERE `id_group`='7'
SELECT * FROM `tpkm_leader_assignment` WHERE `id_group`='7'

    protected function findModel($id) {
        if (($model = Group::findOne($id)) !== null) {
---
SELECT * FROM `tpkm_group` WHERE `id`='7'