frontend/controllers/SiteController.php

SELECT * FROM `tpkm_pegawai` WHERE `user_id`=9
---
    public function actionDashboard() {
        $searchModel = new \common\models\GroupSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $id_user = Yii::$app->user->id;

        if(Yii::$app->user->can('supervisior')){

            $id = \common\models\pegawai\Pegawai::findOne(['user_id' => $id_user])->nip;