common/models/Registerstudents.php

    public function register() {

            $transaction = \Yii::$app->db->beginTransaction();
            try {
                if ($this->validate()) { //rules harus dijalankan
                $user = new User();
                $user->username = $this->username;
                $user->email = $this->email;
                $user->setPassword($this->password);
                $user->generateAuthKey();

                if ($user->save()) {
---
INSERT INTO `tpkm_user` (`username`, `email`, `password_hash`, `auth_key`) VALUES ('if314002', 'if314002@students.del.ac.id', '$2y$13$GZ/xICT8hNUf.vA3YtJ3..JV87VfuaZJKuotZpZwXO5u1PK7xyrJ.', 'ngWdCprFZDLwldU-9CzuDV2VfVT2cFjM')

                    $students->foto = 'upload/foto/1.jpg';
                    $students->user_id = $user->id;

                    if ($students->save())
---
INSERT INTO `tpkm_students` (`nim`, `no_usm`, `jalur`, `user_name`, `kbk_id`, `ref_kbk_id`, `kpt_prodi`, `id_kur`, `tahun_kurikulum_id`, `nama`, `tgl_lahir`, `gol_darah`, `golongan_darah_id`, `jenis_kelamin`, `jenis_kelamin_id`, `agama`, `agama_id`, `alamat`, `kabupaten`, `kode_pos`, `email`, `telepon`, `no_ijazah_sma`, `nama_sma`, `asal_sekolah_id`, `alamat_sma`, `kabupaten_sma`, `telepon_sma`, `kodepos_sma`, `thn_masuk`, `foto`, `user_id`) VALUES ('11314002', '11314002', 'USM1', 'if314002', '11111111', 1, 'D3 TEKNIK INFORMATIKA', 1, 2014, 'if314002', '01-01-1996', '0', 1, 'L', 1, 'DEFAULT', 1, 'Jalan Sisingamangaraja  Institut Teknologi Del', 'Tobasa', '21127', 'if314002@students.del.ac.id', '082168271363', '13sbchsdbcjh198312', 'SMA UNGGUL DEL', 1, 'Jln Arjuna', 'Tobasa', '08212312312', '02122', 2014, 'upload/foto/1.jpg', 46)