common/models/User.php

    public static function findIdentity($id) {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `tpkm_user` WHERE `id`=9

    public static function findByUsername($username) {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `tpkm_user` WHERE `username`='if314003'