frontend/views/layouts/dropdown.php

SELECT * FROM `tpkm_students` WHERE `user_id`=1
SELECT COUNT(*) FROM `tpkm_students` WHERE `user_id`=9
SELECT * FROM `tpkm_pegawai` WHERE `user_id`=9
---

$abs = \common\models\students\Students::find()->where(['user_id'=>Yii::$app->user->id]);

if($abs->count()>0){
    $model = $abs->one();
}
else{
    $model = \common\models\pegawai\Pegawai::find()->where(['user_id'=>Yii::$app->user->id])->one();