common/models/notif/Notification.php

    public function Counts(){
        $model = Notification::find()->where(['user_id'=>Yii::$app->user->id,'seen'=>0]);

        return $model->count();
---
SELECT COUNT(*) FROM `notification` WHERE (`user_id`=9) AND (`seen`=0)